test-plan-utg.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Load Distributor UTG Test" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>
      <!-- Load Distributor element -->
      <ai.loadmagic.jmeter.distributed.LoadDistributor guiclass="ai.loadmagic.jmeter.distributed.LoadDistributorGui" testclass="ai.loadmagic.jmeter.distributed.LoadDistributor" testname="Load Distributor" enabled="true"/>
      <hashTree/>

      <!-- Ultimate Thread Group with 3 schedule rows -->
      <!-- Row format: [threads, initial_delay, startup_time, hold_time, shutdown_time] -->
      <kg.apc.jmeter.threads.UltimateThreadGroup guiclass="kg.apc.jmeter.threads.UltimateThreadGroupGui" testclass="kg.apc.jmeter.threads.UltimateThreadGroup" testname="UTG Load Profile (120 total)" enabled="true">
        <collectionProp name="ultimatethreadgroupdata">
          <!-- Row 1: 60 threads, start at 0s, ramp 1s, hold 2s, shutdown 1s -->
          <collectionProp name="row1">
            <stringProp name="threads">60</stringProp>
            <stringProp name="initial_delay">0</stringProp>
            <stringProp name="startup_time">1</stringProp>
            <stringProp name="hold_time">2</stringProp>
            <stringProp name="shutdown_time">1</stringProp>
          </collectionProp>
          <!-- Row 2: 30 threads, start at 1s, ramp 1s, hold 2s, shutdown 1s -->
          <collectionProp name="row2">
            <stringProp name="threads">30</stringProp>
            <stringProp name="initial_delay">1</stringProp>
            <stringProp name="startup_time">1</stringProp>
            <stringProp name="hold_time">2</stringProp>
            <stringProp name="shutdown_time">1</stringProp>
          </collectionProp>
          <!-- Row 3: 30 threads, start at 2s, ramp 1s, hold 2s, shutdown 1s -->
          <collectionProp name="row3">
            <stringProp name="threads">30</stringProp>
            <stringProp name="initial_delay">2</stringProp>
            <stringProp name="startup_time">1</stringProp>
            <stringProp name="hold_time">2</stringProp>
            <stringProp name="shutdown_time">1</stringProp>
          </collectionProp>
        </collectionProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
      </kg.apc.jmeter.threads.UltimateThreadGroup>
      <hashTree>
        <DebugSampler guiclass="TestBeanGUI" testclass="DebugSampler" testname="Debug" enabled="true">
          <boolProp name="displayJMeterProperties">false</boolProp>
          <boolProp name="displayJMeterVariables">true</boolProp>
          <boolProp name="displaySystemProperties">false</boolProp>
        </DebugSampler>
        <hashTree/>
      </hashTree>

      <!-- Also keep a Standard ThreadGroup to verify both work together -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Standard Workers (50 total)" enabled="true">
        <stringProp name="ThreadGroup.num_threads">50</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <DebugSampler guiclass="TestBeanGUI" testclass="DebugSampler" testname="Debug" enabled="true">
          <boolProp name="displayJMeterProperties">false</boolProp>
          <boolProp name="displayJMeterVariables">true</boolProp>
          <boolProp name="displaySystemProperties">false</boolProp>
        </DebugSampler>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>